tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet/levelSet/R_10x_NB_02x/reEval/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes     
{
    default         Gauss linear;
}

divSchemes      
{
    default         Gauss linear;
    div(phi,U)      bounded Gauss upwind;
    div(-phi,Ua)    bounded Gauss upwind;
}

interpolationSchemes 
{
    default         linear;
}

laplacianSchemes 
{
    default         Gauss linear corrected;
}

snGradSchemes   
{
    default         corrected;
}


// ************************************************************************* //
